In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\adacl\.virtualenvs\pract_projects--m80c34_\lib\site-packages (2.1.1)
Requirement already satisfied: numpy>=1.23.2 in c:\users\adacl\.virtualenvs\pract_projects--m80c34_\lib\site-packages (from pandas) (1.26.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\adacl\.virtualenvs\pract_projects--m80c34_\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\adacl\.virtualenvs\pract_projects--m80c34_\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\adacl\.virtualenvs\pract_projects--m80c34_\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\adacl\.virtualenvs\pract_projects--m80c34_\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [2]:
import pandas as pd

In [3]:
pd.__version__

'2.1.1'

In [4]:
df = pd.DataFrame() #empty dataframe

In [8]:
url = 'https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv'
sep=','
df = pd.read_csv(url, sep = sep)

In [9]:
type(df)

pandas.core.frame.DataFrame

In [7]:
df.head()  #top five

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [10]:
df.tail()  #bottom five

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [13]:
#df with dict
dict = {'Name':['Ram', 'Krishn'], 'Address':['Ayodhya', 'Mathura']}
df = pd.DataFrame(dict)

In [14]:
df

     Name  Address
0     Ram  Ayodhya
1  Krishn  Mathura